import {
  FaComments,
  FaExchangeAlt,
  FaExclamationTriangle,
  FaUserFriends,
  FaCogs,
  FaShareAlt,
  FaUsers,
  FaShieldAlt,
} from "react-icons/fa";

export const cardealerChallenges = [
  {
    title: "スタッフ間の連携",
    description:
      "限られた人員でのオペレーションのため、事務所側の状況や他のスタッフの状況がわからないため、ルーティン業務以外の突発的業務発生時の状況共有や把握が難しい。",
    solution:
      "ネットワークに連携可能なインカム・トランシーバー・無線機の活用によって、ワンプッシュで一斉送信が可能となり、離れた場所にいるスタッフと瞬時に連絡・情報共有が可能になります。他エリアにいるスタッフに対しての応援要請や緊急時の役割分担もスムースに対応可能となります。",
    icon: FaExchangeAlt,
  },
  {
    title: "顧客サービスの向上",
    description: "来店された顧客へのサービス向上で他社と差別化を図りたい。",
    solution:
      "ネットワークに連携可能なインカム・トランシーバー・無線機と顧客情報データベース、ナンバー認証カメラと連動させることによって、来店された顧客が事前予約であるか、顧客であるか、急な来店であるか等の情報を即時に共有することができ、他社にはない顧客体験を提供することが可能となります。",
    icon: FaUserFriends,
  },
  {
    title: "顧客サービスへの集中",
    description: "来店された顧客へのサービスに集中したい。",
    solution:
      "ネットワークに連携可能なインカム・トランシーバー・無線機では、インターホンや各種センサー、入店チャイム、安心カメラ、AI カメラとの連携も可能であるため、速やかなアラートの検知により現場確認等の移動距離、移動時間が短縮でき、効率的なオペレーションが可能となります。",
    icon: FaShareAlt,
  },
];
