import {
  FaComments,
  FaExchangeAlt,
  FaExclamationTriangle,
  FaUserFriends,
  FaCogs,
  FaShareAlt,
  FaUsers,
  FaShieldAlt,
} from "react-icons/fa";

export const hotelChallenges = [
  {
    title: "スタッフ間の連携",
    description:
      "限られた人員でのオペレーションのため、事務所側の状況や他のスタッフの状況がわからないため、ルーティン業務以外の突発的業務発生時の状況共有や把握が難しい。",
    solution:
      "ネットワークに連携可能なインカム・トランシーバー・無線機の活用によって、ワンプッシュで一斉送信が可能となり、離れた場所にいるスタッフと瞬時に連絡・情報共有が可能になります。他フロアにいるスタッフに対しての応援要請や緊急時の役割分担もスムースに対応可能となります。",
    icon: FaExchangeAlt,
  },
  {
    title: "電話にしばられたオペレーション",
    description:
      "電話が事務所にあるため、事務所から離れられない、事務所にしか電話がないので、何があれば事務所まで移動しなければならない。",
    solution:
      "ネットワークに連携可能なインカム・トランシーバー・無線機では、電話との連携も可能であるため、どこにいても外線・内線に発信ができ、着信もできます。そのため、事務所という場所、責任者という役割に左右されず、施設内を網羅するオペレーションが可能となります。",
    icon: FaUserFriends,
  },
  {
    title: "複数の建物や広範囲のエリアの連絡手段",
    description:
      "複数の建物や広範囲のエリアを網羅する通信手段がないために、誰がどこにいるかの把握が難しく、無線機や個人携帯、放送設備等、色々な手段を講じなければならない。",
    solution:
      "ネットワークに連携可能なインカム・トランシーバー・無線機では、無線 LAN を利用するために、複数の建物や広範囲のエリアでの通信を網羅することが可能です。既設の無線 LANを利用できますので、大規模な投資を必要としません。また、インターホンとも連携できますので、省人化も可能です。",
    icon: FaShareAlt,
  },
];
